<?php
$刷新房间 = array(
    'event' => "Msg_DFDC_RoomInfo",
    'area' => 1,
    'uid' => 1,
    // cs
    'data' => [],
    //sc
    'status' => '1成功 其他失败',
    'msg' => "对应的提示",
    'data' => [
        'curgrade' => '当前选中档次',
        'map' => ['地图'],
        'max_multiple' => '最大档次',
        'max_gear' => '最大倍数',
        'level' => '房间等级',
        'doublescore' => '底分',
        'min_gold' => '入场最小金币数',
        'max_gold' => '入场最大金币数',
        'gold' => '当前分数',
        'gear' => '当前倍数',
        'free' => '免费次数',
        'free4' => '0没有选择 其他选择了  游戏等级为4时使用'
    ]
);

$开始游戏 = array(
    'event' => "Msg_DFDC_Start",
    'area' => 1,
    'uid' => 1,
    // cs
    'data' => [
        'multiplp' => '档位',
        'gear' => '线数'
    ],
    //sc
    'status' => '1成功 其他失败',
    'msg' => "对应的提示",
    'data' => [
        'win' => [
            [
                'multiple' => '倍数',
                'type' => '类型'
            ]
        ],
        'score' => '赢分数',
        'gold' => '当前玩家分数',
        'conscore' => '消耗分数',
        'curMap' => ['中奖坐标'],
        'map' => ['地图'],
        'curfree' => '中的免费次数',
        'free' => '当前剩余免费次数',
        'jackpot' => '多喜小奖，多寿中奖，多禄大奖，多福巨奖的中奖金额',
        'type' => '0没有中奖  1 多喜小奖，2 多寿中奖，3 多禄大奖，4多福巨奖',
        'diamonds' => '钻石倍数',
        'jackpotAll' => '奖池分数 
        5档 （小奖=总金额 * 0.1，中奖 = 总金额 * 0.2，大奖 = 总金额 * 0.3，巨奖 = 总金额 * 0.4）
        4档 （小奖= 总金额 * 0.1*0.66 ，中奖= 总金额 *0.2*0.66，大奖 = 总金额 * 0.3*0.66，巨奖 = 总金额 * 0.4*0.66）
        3档 （小奖= 总金额 * 0.1*0.46 ，中奖= 总金额 *0.2*0.46，大奖 = 总金额 * 0.3*0.46，巨奖 = 总金额 * 0.4*0.46）
        2档 （小奖= 总金额 * 0.1*0.26 ，中奖= 总金额 *0.2*0.26，大奖 = 总金额 * 0.3*0.26，巨奖 = 总金额 * 0.4*0.26）
        1档 （小奖= 总金额 * 0.1*0.26 ，中奖= 总金额 *0.2*0.26，大奖 = 总金额 * 0.3*0.26，巨奖 = 总金额 * 0.4*0.26） ',
        'free4' => '0没有选择 其他选择了  游戏等级为4时使用',
        'type' => '1,2,3,4'//大小奖
    ]

);

$退出游戏 = array(
    'event' => "Msg_DFDC_Out",
    'area' => 1,
    'uid' => 1,
    // cs
    'data' => [],
    //sc
    'status' => '1成功 其他失败',
    'msg' => "对应的提示",
    'data' => [
        'gold' => '玩家分数'
    ]
);

$修改地图 = array(
    'event' => "Msg_DFDC_ChangeMap",
    'area' => 1,
    'uid' => 1,
    // cs
    'data' => [
        'width' => '3,4,5' //地图的高
    ],
    //sc
    'status' => '1成功 其他失败',
    'msg' => "对应的提示",
    'data' => []
);
$免费选择图标 = array(
    'event' => "Msg_DFDC_ChangeIcon",
    'area' => 1,
    'uid' => 1,
    // cs
    'data' => [
        'type' => '1=>金色的熊猫 2=>金色乌龟 3=>金色蟾蜍 4=>金色鱼 10=>鞭炮' //地图的高
    ],
    //sc
    'status' => '1成功 其他失败',
    'msg' => "对应的提示",
    'data' => []
);
